[
    {"id": "hr","country":"Croatia","country_ch":"克羅埃西亞","description":"The interior of Croatia has a continental climate, with cold winters and hot summers with abundant rainfall. The wine producing areas are mainly concentrated in the hilly areas adjacent to the Pannonian Plain.  The Dalmatian coast area has a typical Mediterranean climate, but many of the higher locations of the Dinara Mountains have an alpine climate. The coastal areas of the Adriatic Sea are hot and humid in summer and mild in winter, which is very beneficial for grape growing. As for the islands across the water from the coast, many famous wine-producing regions are located on the Dalmatian Islands. A variety of grapes are found on karst slopes, of which there is less rainfall on the steep slopes. The vineyards near the coast sit on the hillside, where sunshine is abundant, which is very conducive to the cultivation of grapes.  The average temperature in January in the inland areas is between 0 and 2 degrees Celsius, and the average temperature in August is between 19 and 23 degrees Celsius. On the coast, the average temperature in January is 6 to 11 degrees Celsius, and the average temperature in August is 21 to 27 degrees Celsius. The average temperature of sea water in winter is 12 degrees Celsius, and the average temperature of sea water in summer is 25 degrees Celsius."},

    {"id": "hu","country":"Hungary","country_ch":"匈牙利","description":"Hungary is located in the Carpathian Basin of Central Europe and is surrounded by land. It has a typical continental climate with extremely hot summers and severe winters. Lake Balaton is the largest lake in Europe and one of the country's important wine-producing regions. The Balaton and Neusiedl lakes are conducive to regulating the continental climate, which can make the grape growing season longer and have a relatively mild climate. Eastern Hungary is the Carpathian Mountains, which can protect the gardens from cold winds and have a significant impact on the local climate. Hungary has a special autumn climate, and the usual haze often covers the sky, which is conducive to brewing delicious noble rot sweet wine."},

    {"id": "sk","country":"Slovakia","country_ch":"斯洛伐克","description":"Igor Mancel, vice-chairman of the Association of Wine Growers and Wine Producers in Slovakia, said that climate warming will help improve the quality of wine in Slovakia. I say so It may be selfish, but it is true. For example, in southern Slovakia, climate warming has made many areas more suitable for planting grape vines, and some areas have begun to experiment with new varieties. Moreover, in the future, our wine style will be very similar to the traditional winemaking style in southern Europe."},

    {"id": "at","country":"Austria","country_ch":"奧地利","description":"The Barossa Valley in South Australia can be regarded as one of Australia's top wine-producing regions. It mainly has a mild to hot continental climate, with a large temperature difference between day and night and long sunshine hours, which makes the grape fruit more concentrated. This producing area is famous for its strong and powerful Shiraz, with outstanding fruity aromas, ripe blackberries, chocolate and spices. World-renowned star wineries such as Penfolds, Seppeltsfield and Wolf Bass are located in the Barossa Valley, which is a must-try area for wine lovers. The world’s oldest Shiraz vine is also preserved in the local area. Due to the low yield of old vines and the deep absorption of more nutrients by the roots, the wine made by it has a unique style, rich flavor and rich layers. It is rushing."},

    {"id": "si","country":"Slovenia","country_ch":"斯洛維尼亞","description":"Slovenia's Penina means Champagne, which is generally known as Champagne. However, Champagne is a proper name and cannot be named arbitrarily. Generally speaking, it is called sparkling wine. For a different experience on summer weekends, start with the Srebrna radgonska penina series. This series is mainly made by the trough method and has been fermented for 6 to 9 months, with a basic body. It presents quite beautiful and clear light golden yellow and light yellow, while the pink wine has an orange-red light color. The overall bubble performance is stable and continuous. The aroma is rich and has a full fruity aroma. The overall performance in the taste part is Very balanced, the pink sparkling wine is stronger than the other two due to the selection of the Zweigle variety, and has a slight conflict with the appearance."},
    
    {"id": "ch","country":"Switzerland","country_ch":"瑞士","description":"Switzerland is dominated by plateaus and mountains, with an average elevation of about 1,350 meters. It is divided into the Alps in the south-central (60% of the total area), the Jura Mountains in the northwest (10%) and the Swiss Plateau (30) Terrain area. Mountains, terraces and steep slopes form the most distinctive features of Swiss vineyards. Like Burgundy, Switzerland is also in the northern temperate zone suitable for growing grapes. However, under the influence of topography, its climate types are very diverse: from west to east, from a mild and humid temperate oceanic climate to a temperate continental climate with cold winters and hot summers, there is also a plateau and mountainous climate locally. Diverse topography and climatic conditions constitute different terroir environments in various regions, providing a suitable environment for the cultivation of different varieties of grapes."},

    {"id": "de","country":"Germany","country_ch":"德國","description":"For hundreds of years, Germany has been famous for making wonderful and delicious wines. It has been cultivated in Germany for 2000 years. Its unique climatic conditions and soils, many precious grape varieties, meticulous and perfect brewing methods, and strict quality inspection standards make German wine unique and enjoy a high reputation in Europe and the world. , Especially famous for producing excellent white wines. The significant difference from wines from other countries is that German wines maintain a natural fruity taste, with low alcohol content and a clear and mellow taste, with a moderate balance of sour and sweetness. Whether it is used to refresh the stomach before a meal or accompanied by various delicacies, it can be called the top grade, so it has become a favorite of wine lovers in the country and around the world. Wine has formed a unique cultural flavor in Germany."},

    {"id": "it","country":"Italy","country_ch":"義大利","description":"Italy's overall climate type is more complicated. Its narrow terrain spans 10 latitudes from north to south. Due to the influence of mountains and the ocean, the microclimates vary greatly from region to region. The northern climate is a continental climate with cold winters and hot summers. Heading south, from the Apennine Peninsula to the southern tip of Italy, the climate is Mediterranean, hot and dry all year round. The latitude and altitude span of Italy is very large, making its soil composition ever-changing. Most of the soil is volcanic rock, limestone and hard rock. In addition, there is also a large amount of gravel clay. The diversified soil provides good cultivation conditions for the wide variety of grape varieties in Italy. Italy has a very rich variety of grapes, with more than 2,000 varieties. The largest cultivated area is Sangiovese, followed by Sicily's white grape variety Catarratto, central Italy's white grape variety Trebbiano, Piedmont's Barbera and Apulia's Negroamaro."},

    {"id": "gb","country":"United Kingdom","country_ch":"英國","description":"As we all know, Britain is mild and rainy all year round. The cultivation of grapes is mainly concentrated in the south, where the climate is slightly warmer and drier. Due to the impact of global warming, the annual average temperature in the UK has gradually increased, and the grape ripening problem that has long plagued British winemakers will become a thing of the past. However, at present, the best grape growing areas in the UK are located on the south coast of England, from Cornwall to Kent. Their climate and soil types are similar, and they can grow grape varieties adapted to cool climates."},

    {"id": "fr","country":"France","country_ch":"法國","description":"The wine region of France lies between 42 and 49.5 degrees north latitude. The southern part has a Mediterranean climate, the western part has a relatively high altitude and is also affected by the Gulf Stream, while the eastern part of Burgundy, Alsace and Champagne have more continental climate characteristics. The rich variety and superior quality of French wines create excellent geographical and climatic conditions. In the past few decades, the most widely planted grape variety in France is Garignan. But now Merlot’s planting area ranks first, followed by two grape varieties with the same planting area-Grenache and Garignan, and the fourth largest variety is Ugni Blanc, followed by Cabernet Sauvignon, Syrah, Chardonnay and Cabernet Franc. France has strict legal protection for its own wines, and implements the origin control naming system, namely the AOC system. This protection system divides wine into daily table wine (VDT, accounting for 11.7%), regional table wine (VDP, accounting for 33.9%), excellent regional table wine (VDQS, accounting for 0.9%), and wine from legal regions (AOC, accounting for 53.4 %). This system has a profound impact not only on France, but also on the entire world."},

    {"id": "pt","country":"Portugal","country_ch":"葡萄牙","description":"The climate in Portugal is very suitable for growing grapes. It is a mild maritime climate with warm summers and cool and humid winters. The more extreme the climate is to the south and east. Although the terroir of Portugal is not as vast and complex as France and Italy, the climate of mountains, river valleys, sandy areas, and limestone-rich coastal hills is very variable. Plain areas are more affected by the prevailing Atlantic winds. The annual rainfall in the southern mountains of Oporto can reach 2,000 mm, while in some inland areas the annual rainfall is only 500 mm. The main wine regions in Portugal include Alentejo, Algarve, Azores, Beiras, Bairrada, Dao, Douro, Estremadura – Lisboa, Madeira, Minho, Ribatejo, Setubal Peninsula and Transmontano. The best and most unique red grape varieties in the country are Touriga, Tempranillo, Baga, Castelao and Trincadeira. The main white grape varieties are Arinto, Alvarinho, Verdelho, Bubal and Seical."},

    {"id": "es","country":"Spain","country_ch":"西班牙","description":"Spain is now the third largest wine producing country, but it has the largest vineyard area, but due to drought and water shortage, the total output is not as good as France and Italy. Spain has a long history of wine and the terrain is dominated by plateaus. The north and the northwest are adjacent to the Atlantic Ocean, and the east and the southeast are the Mediterranean. Therefore, there are different climatic environments such as temperate climate, plateau climate, and Mediterranean climate. Wine styles are quite changeable. For a long time, the quality of early wines is based on 「ageing for longer」. Therefore, there are Crianza, Reserva, Gran Reserva and other classifications. However, under the influence of storage cost considerations and international preference tastes, the style is getting cleaner and younger. Many wineries only produce Reserva grade wines, although Gran Reseva is increasing. The less common it is, the newer and fruity Gran Reserva wines can still be seen. These are the changing trajectories of Spain."},

    {"id": "be","country":"Belgium","country_ch":"比利時","description":"The latitude of Belgium is approximately 50°N, bordering France in the southwest and the Atlantic Ocean in the northwest. Like neighboring countries such as Luxembourg, the Netherlands and Germany, the climate here is relatively cold and only high acid and cold-resistant grape varieties can be planted. Therefore, the main wines produced here are sparkling wine (accounting for 48%) and white wine (accounting for 48%). 32%). There are about 50 varieties of grapes grown in Belgium, some are hybrids of local varieties, and some international varieties such as Chardonnay, Pinot Gris, Riesling and Pinot Noir."}
]